In [1]:
import pandas as pd

# DataFrame
- 2 차원 배열  
- 행과 열로 구성  
- DataFrame 만들때에는 Dictionary가 편함!

In [2]:
# Dictionary를 이용한 DataFrame 생성

dict_data = {'c0':[1,2,3], 'c1':[4,5,6],'c2':[7,8,9], "c3":[10,11,12], 'c4':[13,14,15]}
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [3]:
df = pd.DataFrame(dict_data)
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

list 는   
         -  
         -  
         -  
이렇게 쌓이고  
Dictionary 는 | | | 이렇게 쌓인다

In [6]:
# List를 이용한 DataFrame 생성
df = pd.DataFrame(
    [
        [15,'남','덕영중'],
        [17, '여', '수리중']
    ],index=['준서','예은'],
     columns=['나이','성별','학교']
)
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [8]:
# 행과 열 이름 변경하기
print(df.index)
print(df.columns)

Index(['준서', '예은'], dtype='object')
Index(['나이', '성별', '학교'], dtype='object')

In [9]:
# 행 인덱스 , 열 이름 변경하기 - 1
df.index = ['학생1','학생2']
df.columns = ['연령','남녀','소속']
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [10]:
# List를 이용한 DataFrame 생성
df = pd.DataFrame(
    [
        [15,'남','덕영중'],
        [17, '여', '수리중']
    ],index=['준서','예은'],
     columns=['나이','성별','학교']
)
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [12]:
# 행 인덱스 , 열 이름 변경하기 - 2
# inplace=True 모든함수에 적용가능한 명령어 = > 바로 적용하겠다 라는 명령어
df.rename(columns={'나이':'연령','성별':'남녀',"학교":'소속'}, inplace=True)
df

    연령 남녀   소속
준서  15  남  덕영중
예은  17  여  수리중

In [13]:
# 행 이름 변경하기
# df의 행 인덱스 중에서, '준서'를 '학생1'로, '예은'을 '학생2'로 바꾸기
df.rename(index={'준서':'학생1', '예은':'학생2'}, inplace=True)
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

---
### 문제

In [14]:
score = {'서준':[90, 98, 85, 100],'우현':[80,89,95,90],'인아':[70,95,100,90]}
score

{'서준': [90, 98, 85, 100], '우현': [80, 89, 95, 90], '인아': [70, 95, 100, 90]}

In [16]:
score_df = pd.DataFrame(score).T
score_df

     0   1    2    3
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [19]:
score_df.rename(columns={0:'수학',1:'영어',2:'음악',3:'체육'}, inplace= True)
score_df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

### 행삭제

In [27]:
# 복사하기
df2 = score_df.copy()

In [28]:
df2

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [29]:
# df2의 index가 우현인 1개 행을 삭제 => drop()
df2.drop('우현', axis=0, inplace= True) #axis=0  (== axis='rows')디폴트값 인데 적어주는게 좋음

In [30]:
df2

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [38]:
# 복사하기
df3 = score_df.copy()

In [40]:
df3

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [41]:
#df3의 index가 우현과 인아인 2개 행을 삭제
df3.drop(['우현','인아'], axis=0, inplace=True)
df3

    수학  영어  음악   체육
서준  90  98  85  100

### 열삭제

In [42]:
# 복사하기
df4 = score_df.copy()
df4

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [43]:
# df4의 수학 1개 열을 삭제
df4.drop('수학', axis=1, inplace=True)

In [44]:
df4

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [47]:
# 복사하기
df5 = score_df.copy()
df5

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [48]:
# dr5의 영어와 음악 2개 열을 삭제
df5.drop(["영어","음악"],axis='columns', inplace=True)
df5

    수학   체육
서준  90  100
우현  80   90
인아  70   90